# BuiltInParameter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
InternalDefinition..::..BuiltInParameter Property
InternalDefinition Class See Also
---
Tests whether this definition identifies a built-in parameter or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public BuiltInParameter BuiltInParameter { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BuiltInParameter As BuiltInParameter
	Get
```

Visual C++
---
```text
public:
property BuiltInParameter BuiltInParameter {
	BuiltInParameter get ();
}
```

# Remarks
For a build-in parameter this property equals one of the BuiltInParameter enumerated values. For custom-defined parameters, such as shared, global, or family parameters the value is always BuiltInParameter.INVALID.
# See Also
InternalDefinition Class
Autodesk.Revit.DB Namespace